import re
# text ="""id: 1054820423 ,
# username: @saaman_pc 
# balance of user : 0
# balance increase amount:‌ 180 T H"""
text="""info : 4_0_8
        ---------------------------------------------
مشخصات پیش فاکتور رزرو شما:
    روز = دوشنبه
    تاریخ = 15-05-1403 
    ساعت = 17:00
    قیمت = 8 هزار تومان
      
------------------ 
 موجودی حساب شما : 100 هزار تومان
        لطفا بنر خود را برای ما ارسال کنید
        در صورتی که بنر چنل ما را ندارید لطفا از دکمه 'ساخت بنر' استفاده کنید"""
pattern = r"\d+"

x=re.findall(pattern=pattern,string=text)
print(x)