from configs.auth import BOT_USERNAME, SUPPORT_ID
from configs.basic_info import *
from message_and_text.bot_messages import *
from message_and_text.Markups import markup_user_make_banner
from message_and_text.basic import make_line

##########

msg_restart="👋🏻ربات مجدد راه اندازی شد👋🏻"
msg_make_banner=f"👇🏻برای ساخت بنر روی دکمه زیر کلیک کنید👇🏻"
msg_select_day="👇🏻از  لیست زیر روز دلخواه را انتخاب کنید👇🏻"
msg_change_score=f"مبنای تبدیل امتیاز : \n هر {base_score} ✨ معادل  {base_score_value} هزارتومان است💵 \n👇🏻 برای تبدیل امتیازات خود از دکمه زیر استفاده کنید👇🏻"
msg_score_is_converted=f"💵امتیاز شما با موفقیت تبدیل شد✨"
msg_userList="👤لیست کاربران👤"
#join check
msg_joined="به این ربات خوش امدی 😍 \n برای رزرو لینک اول باید از بخش حساب کاربری حسابت رو شارژ کنی 💵 \n بعدش باید بری از بخش ساعت های خالی، ساعتی که می خواهید انتخاب کنی 😎"
###########3333
increase_balance_msg=f"""با انتخاب طرح های ساده ، امتیاز دریافت می کنید که از این امتیاز ها نیز می توانید برای رزرو لینک استفاده کنید
{make_line}
با انتخاب طرح های ویژه حساب شما بیشتر شارژ می شود
{make_line}
ویژه یک: با پرداخت {price_plan1_off} هزار تومان حساب شما {price_plan1} هزار تومان شارژ می شود
ویژه دو: با پرداخت {price_plan2_off} هراز تومان حساب شما {price_plan2} هزار تومان شارژ می شود
ویژه سه: با پرداخت {price_plan3_off} هزار تومان حساب شما {price_plan3} هزار تومان شارژ می شود
"""
############
support_msg=f"""<a href='tg://user?id={SUPPORT_ID}'> برا ارتباط با پشتیبان لطفا روی این متن کلیک کنید </a>"""

msg_reserve_week="یکی از تایم های زیر را جهت رزرو هفتگی انتخاب کنید"


msg_check_income="🤑درآمد کدام ماه را بگویم؟🤑"
msg_banner_is_accepted="✅بنر شما در ساعت انتخاب شده گذاشته می شود✅"

msg_available_time_for_week="""ساعت های قابل رزرو برای یک هفته ⏰
 لطفا یکی از ساعات زیر را انتخاب کنید 📝
 🚫در رزرو هفتگی لینک های شما از روز بعد شروع می‌شوند🚫
 """
msg_available_time_for_month="ساعت های قابل رزرو برای ۳۰ روز\n لطفا یکی از ساعات زیر را انتخاب کنید"

msg_pls_send_banner="📝بنر خود را ارسال کنید📝"



msg_change_price_min="قیمت بنر ساعت ۱۳ تا ۱۷ را وارد کنید"
msg_change_price_mid="قیمت بنر ساعت ۱۸ تا ۰۱:۳۰ را وارد کنید"
msg_change_price_max="قیمت پست اخر را وارد کنید"

msg_not_a_int="لطفاً یک مقدار عددی وارد کنید."

msg_start_command = f"""🥳 خوش آمدید! 🥳
این ربات مخصوص کانال @linkGp است.
{make_line}
<b> مراحل استفاده از ربات: </b>

1️⃣ ابتدا حساب کاربری خود را شارژ کنید. 💵

2️⃣ منتظر تأیید ادمین بمانید. ⏳

3️⃣ سپس یک بنر برای خود بسازید. 📝

4️⃣ از بخش "ساعت‌های خالی" ساعت مورد نظر خود را انتخاب کنید. ⏰
"""

admin_link = ""
not_join_text = f"⚠️ برای استفاده از این ربات باید در کانال ما عضو شوید: \n @linkGP"
restart_link_bot = f"https://t.me/{BOT_USERNAME}?start=start"
link=f"https://t.me/{BOT_USERNAME}"

# گزینه‌های افزایش امتیاز
increase_plans_btn_text = [
    f"💸 {price_1} هزار تومان (یک امتیاز)",
    f"💸 {price_2} هزار تومان (دو امتیاز)",
    f"💸 {price_3} هزار تومان (سه امتیاز)",
    f"🌟 ویژه یک: {price_plan1_off} هزار تومان",
    f"🌟 ویژه دو: {price_plan2_off} هزار تومان",
    f"🌟 ویژه سه: {price_plan3_off} هزار تومان"
]

admin_welcome_msg = "🎉 خوش آمدی، ادمین!"


forward_banner_text = "📤 بنر شما برای بررسی به ادمین ارسال شد. \n✅ پس از تأیید، لینک به‌صورت خودکار ارسال خواهد شد."
accept_banner_text = "📤 بنر شما برای ادمین ارسال شد. \n✅ پس از تأیید، لینک به‌صورت خودکار ارسال می‌شود."


#error messages
msg_error_banner_not_mach = f"""🚫 بنر ارسالی شما با الگوی کانال مطابقت ندارد! 🚫
لطفاً از دکمه «{markup_user_make_banner}» استفاده کرده و دوباره تلاش کنید. 🙏🏻
"""
msg_error_not_admin = "❌ شما دسترسی ادمین ندارید."

msg_error_bot_is_disable = "⛔️ ربات در حال حاضر غیر فعال است. لطفاً بعداً دوباره امتحان کنید. 🙏"

msg_error_to_user = "🚨 مشکلی پیش آمده است! لطفاً دوباره تلاش کنید. 🔄"

msg_error_card_number_is_not_valid="مقدار وارد شده یک شماره کارت نمی باشد"

msg_error_reboot_text = f"""❌ مشکلی پیش آمده است.
لطفاً ربات را مجدداً راه‌اندازی کنید. 
برای راه‌اندازی روی 
<a href='{link}'>/start</a>
ضربه بزنید.
"""
msg_error_link_isDuplicated="""🚫لینک شما تکراری است🚫
⛔️هر گروه فقط یک بار در روز اجازه تبلیغ دارد⛔️"""
msg_error_link_isDuplicated_weak="""🚫لینک شما تکراری است🚫
در یکی از روز های هفته گروه شما رزرو دارد
⛔️هر گروه فقط یک بار در روز اجازه تبلیغ دارد⛔️"""

msg_error_time_is_past="🚫زمان انتخاب شده قابل رزرو نیست🚫\n 📝ساعت یا تاریخ انتخاب شده گذشته است📝 \n 🙏🏻لطفا مجدد تلاش کن🙏🏻"

msg_error_to_late_to_reserve="🚫به علت تاخیر بیش از ۱۵ دقیقه در ارسال بنر ساعت انتخاب شده قابل رزرو نمی باشد🚫\n🙏🏻لطفا مجدد تلاش کن🙏🏻"

msg_error_to_late_to_cancel="🚫این رزرو قابل کنسل کردن نمی باشد🚫\n🙏🏻شما حداکثر تا ۳۰ دقیقه قبل هر رزرو باید برای کنسل کردن اقدام کنید🙏🏻"

msg_error_time_not_reserve_able="🚫زمان انتخاب شده قابل رزرو نیست🚫\n 🙏🏻لطفا مجدد تلاش کن🙏🏻"

msg_error_time_is_past_week_reserve="🚫لینک های شما از فردا برای ارسال اغاز می شوند🚫\n 📝ساعت انتخاب شده در روز جاری گذشته است📝"

msg_error_not_member="🚫برای استفاده از ربات نیاز است در کانال های زیر عضو شوید🚫"

msg_error_not_in_db="🚫مشکلی پیش اماده و اکانت شما در ربات ساخته نشده است \n لطفا مجدد ربات را راه اندازی کنید"

msg_error_bot_need_reboot="🚫ربات نیاز به راه اندازی مجدد دارد لطفا ربات را مجدد راه اندازی کنید🚫"
