from configs.auth import SUPPORT_ID
from message_and_text.text import *
##########
make_line="-----------------------------------------------------------------------"
msg_restart="👋🏻ربات مجدد راه اندازی شد👋🏻"
msg_make_banner=f"👇🏻برای ساخت بنر روی دکمه زیر کلیک کنید👇🏻"
msg_select_day="👇🏻از  لیست زیر روز دلخواه را انتخاب کنید👇🏻"
msg_change_score=f"مبنای تبدیل امتیاز : \n هر {base_score} ✨ معادل  {base_score_value} هزارتومان است💵 \n👇🏻 برای تبدیل امتیازات خود از دکمه زیر استفاده کنید👇🏻"
msg_score_is_converted=f"💵امتیاز شما با موفقیت تبدیل شد✨"
msg_userList="👤لیست کاربران👤"
#join check
msg_not_member="🚫برای استفاده از ربات نیاز است در کانال های زیر عضو شوید🚫"
msg_not_in_db="🚫مشکلی پیش اماده و اکانت شما در ربات ساخته نشده است \n لطفا مجدد ربات را راه اندازی کنید"
msg_bot_need_reboot="🚫ربات نیاز به راه اندازی مجدد دارد لطفا ربات را مجدد راه اندازی کنید🚫"
msg_joined="به این ربات خوش امدی 😍 \n برای رزرو لینک اول باید از بخش حساب کاربری حسابت رو شارژ کنی 💵 \n بعدش باید بری از بخش ساعت های خالی، ساعتی که میخوای انتخاب کنی 😎"
###########3333
increase_balance_msg=f"""با انتخاب طرح های ساده ، امتیاز دریافت میکنید که از این امتیاز ها نیز میتوانید برای رزرو لینک استفاده کنید
{make_line}
با انتخاب طرح های ویژه حساب شما بیشتر شارژ میشود
{make_line}
ویژه یک: با پرداخت {price_plan1_off} هزار تومان حساب شما {price_plan1} هزار تومان شارژ میشود
ویژه دو: با پرداخت {price_plan2_off} هراز تومان حساب شما {price_plan2} هزار تومان شارژ میشود
ویژه سه: با پرداخت {price_plan3_off} هزار تومان حساب شما {price_plan3} هزار تومان شارژ میشود
"""
############
support_msg=f"""<a href='tg://user?id={SUPPORT_ID}'> برا ارتباط با پشتیبان لطفا روی این متن کلیک کنید </a>"""
# support_msg=f"برای ارتباط باپشتیبانی روی <a href='tg://user?id={SUPPORT_ID}'>این </a> متن کلیک کنید"
msg_time_is_past="🚫زمان انتخاب شده قابل رزرو نیست🚫\n 📝ساعت یا تاریخ انتخاب شده گذشته است📝 \n 🙏🏻لطفا مجدد تلاش کن🙏🏻"

msg_reserve_week="یکی از تایم های زیر را جهت رزرو هفتگی انتخاب کنید"


msg_check_income="از لیست زیر ماه میلادی که میخواهید درامد ان را مشاهده کنید انتخاب کنید"
msg_banner_is_accepted=""