from configs.auth import SUPPORT_ID
from message_and_text.text import *
##########
make_line="-----------------------------------------------------------------------"
restart_msg="ربات مجدد راه اندازی شد"
#join check
not_member_msg="برای استفاده از ربات نیاز است در کانال های زیر عضو شوید"
not_in_db_msg="مشکلی پیش اماده و اکانت شما در ربات ساخته نشده است \n لطفا مجدد ربات را راه اندازی کنید"
bot_need_reboot_msg="ربات نیاز به راه اندازی مجدد دارد لطفا ربات را مجدد راه اندازی کنید"
joined_msg="""ربات اماده استفاده است"""
###########3333
increase_balance_msg=f"""با انتخاب طرح های ساده ، امتیاز دریافت میکنید که از این امتیاز ها نیز میتوانید برای رزرو لینک استفاده کنید
{make_line}
با انتخاب طرح های ویژه حساب شما بیشتر شارژ میشود
{make_line}
ویژه یک: با پرداخت {price_plan1_off} هزار تومان حساب شما {price_plan1} هزار تومان شارژ میشود
ویژه دو: با پرداخت {price_plan2_off} هراز تومان حساب شما {price_plan2} هزار تومان شارژ میشود
ویژه سه: با پرداخت {price_plan3_off} هزار تومان حساب شما {price_plan3} هزار تومان شارژ میشود
"""
############
# support_msg=f"""<a href href='tg://user?id={SUPPORT_ID}> برا ارتباط با پشتیبان لطفا روی این متن کلیک کنید </a>"""
support_msg=f"""<a href='tg://user?id={SUPPORT_ID}'>برا ارتباط با پشتیبان لطفا روی این متن کلیک کنید </a>"""
# support_msg=f"برای ارتباط باپشتیبانی روی <a href='tg://user?id={SUPPORT_ID}'>این </a> متن کلیک کنید"
